Repository: Sunalamye/Naki
Catalog: command/Resources/Localizable.xcstrings
Source language: zh_hant
Languages: en, ja, ko, zh_hans

source: 換伺服器會**整頁重新載入**，等於登出重來——各服的帳號不互通。對局中不要換。
en: Switching servers **reloads the whole page**, which signs you out — accounts are not shared between servers. Don't switch during a game.
ja: サーバーを切り替えると**ページ全体が再読み込み**され、ログアウトされます——サーバー間でアカウントは共通ではありません。対局中は切り替えないでください。
ko: 서버를 바꾸면 **페이지 전체가 다시 로드**되어 로그아웃됩니다——서버 간에 계정이 호환되지 않습니다. 대국 중에는 바꾸지 마세요.
zh_hans: 切换服务器会**整页重新加载**，相当于退出登录重来——各服务器的账号互不通用。对局中请勿切换。

source: 搜索...
en: Search...
ja: 検索...
ko: 검색...

source: 整包 %lld bytes
en: bundle is %lld bytes
ja: 合計 %lld bytes
ko: 전체 %lld bytes

source: 新安裝（原無有效版本）：capabilities %@
en: New install (no valid version before): capabilities %@
ja: 新規インストール（有効な既存版なし）：capabilities %@
ko: 새로 설치(유효한 기존 버전 없음): capabilities %@
zh_hans: 新安装（原无有效版本）：capabilities %@

source: 方案
en: Plan
ja: プラン
ko: 요금제

source: 日服
en: JP Server
ja: 日本サーバー
ko: 일본 서버

source: 日誌
en: Log
ja: ログ
ko: 로그
zh_hans: 日志

source: 日誌分類
en: Log category
ja: ログの分類
ko: 로그 분류
zh_hans: 日志分类

source: 暱稱隱藏與牌面高亮已改由**插件**提供（工具列拼圖圖示 → 插件頁面）。裝「暱稱隱藏」「牌面變色」插件即可；底層 API 仍在，只是不再內建自動開。
en: Nickname hiding and tile highlighting are now provided by **plugins** (puzzle icon in the toolbar → Plugins page). Just install the "Hide Nicknames" and "Tile Recolor" plugins; the underlying API is still there, it's just no longer enabled automatically.
ja: ニックネームの非表示と牌のハイライトは**プラグイン**で提供されるようになりました（ツールバーのパズルアイコン → プラグインページ）。「ニックネーム非表示」「牌の色変更」プラグインを入れてください。基盤の API は残っており、組み込みで自動的にオンにならなくなっただけです。
ko: 닉네임 숨기기와 패 강조는 이제 **플러그인**으로 제공됩니다(도구 모음의 퍼즐 아이콘 → 플러그인 페이지). "닉네임 숨기기"와 "패 색 변경" 플러그인을 설치하세요. 내부 API는 그대로 있으며, 더 이상 기본으로 자동 켜지지 않을 뿐입니다.
zh_hans: 昵称隐藏与牌面高亮已改由**插件**提供（工具栏拼图图标 → 插件页面）。安装“昵称隐藏”“牌面变色”插件即可；底层 API 仍在，只是不再内置自动开启。

source: 更新
en: Updates
ja: アップデート
ko: 업데이트

source: 更新了 %lld/%lld 個插件（已啟用的會熱重載）。
en: Updated %1$lld/%2$lld plugin(s) (enabled ones are hot-reloaded).
ja: %2$lld 個中 %1$lld 個のプラグインを更新しました（有効なものはホットリロードされます）。
ko: 플러그인 %2$lld개 중 %1$lld개를 업데이트했습니다(사용 중인 것은 핫 리로드됩니다).
zh_hans: 已更新 %1$lld/%2$lld 个插件（已启用的会热重载）。

source: 更新這些（%lld）
en: Update These (%lld)
ja: これらを更新（%lld）
ko: 이 항목 업데이트(%lld)
zh_hans: 更新这些（%lld）

source: 最低房
en: Lowest room
ja: 最低の部屋
ko: 최저 방

source: 最佳選擇
en: Best choice
ja: 最善の選択
ko: 최선의 선택
zh_hans: 最佳选择

source: 最高房
en: Highest room
ja: 最高の部屋
ko: 최고 방

source: 會刪掉 %@ 的整個插件目錄。可重新匯入或放檔案救回。
en: This deletes the whole plugin directory of %@. You can re-import it or restore it by putting the files back.
ja: %@ のプラグインディレクトリ全体を削除します。再インポートするか、ファイルを戻せば復元できます。
ko: %@의 플러그인 디렉터리 전체가 삭제됩니다. 다시 가져오거나 파일을 되돌려 놓아 복구할 수 있습니다.
zh_hans: 将删除 %@ 的整个插件目录。可重新导入或放回文件恢复。

source: 有 %lld 個插件可更新——確認後才會安裝並熱重載：
en: %lld plugin(s) can be updated — they are installed and hot-reloaded only after you confirm:
ja: %lld 個のプラグインを更新できます——確認後にインストールしてホットリロードします:
ko: 플러그인 %lld개를 업데이트할 수 있습니다——확인 후에야 설치하고 핫 리로드합니다:
zh_hans: 有 %lld 个插件可更新——确认后才会安装并热重载：

source: 有新版本 %@
en: Version %@ is available
ja: 新しいバージョン %@ があります
ko: 새 버전 %@ 사용 가능

source: 未啟用
en: Not enabled
ja: 無効
ko: 사용 안 함
zh_hans: 未启用

source: 未在對局
en: Not in a game
ja: 対局中ではありません
ko: 대국 중 아님
zh_hans: 未在对局

source: 未連接
en: Disconnected
ja: 未接続
ko: 연결 안 됨
zh_hans: 未连接

source: 未運行
en: Not running
ja: 停止中
ko: 실행 안 됨
zh_hans: 未运行

source: 未選擇
en: Not selected
ja: 未選択
ko: 선택 안 됨
zh_hans: 未选择

source: 本機 Core ML
en: On-device Core ML
ja: このデバイスの Core ML
ko: 이 기기의 Core ML
zh_hans: 本机 Core ML

source: 東
en: East
ko: 동
zh_hans: 东

source: 東%lld局
en: East %lld
ko: 동%lld국
zh_hans: 东%lld局

source: 東家
en: East
ko: 동가
zh_hans: 东家

source: 槓
en: Kan
ja: カン
ko: 깡
zh_hans: 杠

source: 模型
en: Model
ja: モデル
ko: 모델

source: 模型與資料來源
en: Model and data source
ja: モデルとデータの情報源
ko: 모델 및 데이터 출처
zh_hans: 模型与数据来源

source: 模式
en: Mode
ja: モード
ko: 모드

source: 模式已變更: %@, 推薦數: %lld
en: Mode changed: %@, recommendations: %lld
ja: モード変更: %@、おすすめ数: %lld
ko: 모드 변경: %@, 추천 수: %lld
zh_hans: 模式已变更: %@, 推荐数: %lld

source: 模式選單只提供「關 / 推薦」。
en: The mode menu only offers "Off / Recommend".
ja: モードメニューには「オフ / おすすめ」のみ表示されます。
ko: 모드 메뉴에는 "끔 / 추천"만 표시됩니다.
zh_hans: 模式菜单只提供“关 / 推荐”。

source: 檢查 / 刷新狀態
en: Check / Refresh Status
ja: 確認 / 状態を更新
ko: 확인 / 상태 새로고침
zh_hans: 检查 / 刷新状态

source: 檢查中…
en: Checking…
ja: 確認中…
ko: 확인 중…
zh_hans: 检查中…

source: 檢查了 %lld 個，沒有更新。
en: Checked %lld; no updates.
ja: %lld 個を確認しました。更新はありません。
ko: %lld개를 확인했으며 업데이트가 없습니다.
zh_hans: 检查了 %lld 个，没有更新。

source: 檢查失敗
en: Check failed
ja: 確認に失敗しました
ko: 확인 실패
zh_hans: 检查失败

source: 檢查更新
en: Check for Updates
ja: 更新を確認
ko: 업데이트 확인
zh_hans: 检查更新

source: 檢查更新…
en: Check for Updates…
ja: 更新を確認…
ko: 업데이트 확인…
zh_hans: 检查更新…

source: 權限宣告未變
en: Permission declaration unchanged
ja: 権限宣言に変更なし
ko: 권한 선언 변경 없음
zh_hans: 权限声明未变

source: 權限變更：%@
en: Permission changes: %@
ja: 権限の変更: %@
ko: 권한 변경: %@
zh_hans: 权限变更：%@

source: 正在切換到%@…
en: Switching to %@…
ja: %@に切り替え中…
ko: %@(으)로 전환 중…
zh_hans: 正在切换到%@…

source: 正在加載雀魂...
en: Loading Mahjong Soul...
ja: 雀魂を読み込み中...
ko: 작혼 불러오는 중...
zh_hans: 正在加载雀魂...

source: 正在強制重連...
en: Forcing reconnect...
ja: 強制再接続中...
ko: 강제 재연결 중...
zh_hans: 正在强制重连...

source: 正在載入%@…
en: Loading %@…
ja: %@ を読み込み中…
ko: %@ 불러오는 중…
zh_hans: 正在加载%@…

source: 正在重新載入…
en: Reloading…
ja: 再読み込み中…
ko: 다시 불러오는 중…
zh_hans: 正在重新加载…

source: 此裝置不支援自動送出，已改為推薦模式
en: Auto-send is unsupported on this device; switched to Recommend
ja: この端末は自動送信に対応していないため、おすすめモードに切り替えました
ko: 이 기기는 자동 전송을 지원하지 않아 추천 모드로 전환했습니다
zh_hans: 此设备不支持自动发送，已改为推荐模式

source: 此裝置走 iOS 17–25 的舊版 WebView 路徑，該路徑的自動送出缺少輪詢閘門與重試保護，也沒有任何實機對局驗證，因此只提供推薦顯示；動作請自己下。
en: This device uses the legacy WebView path of iOS 17–25. Auto-send on that path lacks a polling gate and retry protection and has not been verified in any real-device game, so only recommendations are shown; please make your moves yourself.
ja: このデバイスは iOS 17–25 の旧 WebView 経路を使用します。この経路の自動送信にはポーリングゲートと再試行の保護がなく、実機での対局検証も行われていないため、おすすめの表示のみ提供します。操作はご自身で行ってください。
ko: 이 기기는 iOS 17–25의 구형 WebView 경로를 사용합니다. 이 경로의 자동 전송에는 폴링 게이트와 재시도 보호가 없고 실기기 대국 검증도 이루어지지 않았으므로 추천 표시만 제공합니다. 동작은 직접 실행해 주세요.
zh_hans: 此设备走的是 iOS 17–25 的旧版 WebView 路径，该路径的自动发送缺少轮询闸门与重试保护，也没有任何真机对局验证，因此只提供推荐显示；请自行操作。

source: 每次啟動都會問要連哪個伺服器，上次選的會預先選起來。
en: You'll be asked which server to connect to at every launch; the last choice is preselected.
ja: 起動のたびに接続するサーバーを確認し、前回の選択が最初から選ばれます。
ko: 시작할 때마다 연결할 서버를 묻고, 지난번 선택이 미리 선택됩니다.
zh_hans: 每次启动都会询问要连接哪个服务器，上次的选择会预先选中。

source: 決策來源
en: Decision source
ja: 判断の情報源
ko: 판단 출처
zh_hans: 决策来源

source: 清除搜尋
en: Clear search
ja: 検索をクリア
ko: 검색 지우기
zh_hans: 清除搜索

source: 清除日誌
en: Clear log
ja: ログを消去
ko: 로그 지우기
zh_hans: 清除日志

source: 測試中…
en: Testing…
ja: テスト中…
ko: 테스트 중…
zh_hans: 测试中…

source: 測試連線
en: Test Connection
ja: 接続テスト
ko: 연결 테스트
zh_hans: 测试连接

source: 準備就緒
en: Ready
ja: 準備完了
ko: 준비 완료
zh_hans: 准备就绪

source: 無
en: None
ja: なし
ko: 없음
zh_hans: 无

source: 無效插件
en: Invalid plugin
ja: 無効なプラグイン
ko: 잘못된 플러그인
zh_hans: 无效插件

source: 無法重連：WebView 不可用
en: Cannot reconnect: WebView unavailable
ja: 再接続できません：WebView が利用できません
ko: 재연결 불가: WebView를 사용할 수 없음
zh_hans: 无法重连：WebView 不可用

source: 牌局
en: Game
ja: 対局
ko: 대국

source: 牌局封包解析失敗
en: Game packet parsing failed
ja: 対局パケットの解析に失敗
ko: 대국 패킷 해석 실패
zh_hans: 牌局封包解析失败

source: 牌局封包解析失敗：這一局 Naki 不會給推薦，也不會自動打牌
en: Game packet parsing failed: Naki will give no recommendations and will not auto-play this round
ja: 対局パケットの解析に失敗: この局では Naki はおすすめを出さず、自動プレイも行いません
ko: 대국 패킷 해석 실패: 이번 국에서는 Naki가 추천을 하지 않고 자동 플레이도 하지 않습니다
zh_hans: 牌局封包解析失败：这一局 Naki 不会给出推荐，也不会自动打牌

source: 牌局與模型資訊
en: Game and model info
ja: 対局とモデルの情報
ko: 대국 및 모델 정보
zh_hans: 牌局与模型信息

source: 牌桌底部那條浮動訊息（連線狀態、未自動送出的原因等）。預設關閉——它疊在牌桌上，而內容多半是一次性回饋或診斷輸出。真正不會自己好的錯誤走頂端橫幅，不受這個開關影響。
en: The floating message at the bottom of the table (connection status, reasons why nothing was auto-sent, etc.). Off by default — it overlaps the table and its content is mostly one-off feedback or diagnostics. Errors that won't fix themselves use the top banner and are not affected by this switch.
ja: 卓の下部に浮かぶメッセージ（接続状態、自動送信されなかった理由など）です。既定ではオフです——卓の上に重なり、内容も多くは一度きりのフィードバックや診断出力だからです。自然に直らないエラーは上部のバナーに表示され、このスイッチの影響を受けません。
ko: 테이블 하단에 떠 있는 메시지입니다(연결 상태, 자동 전송되지 않은 이유 등). 기본값은 꺼짐입니다——테이블 위에 겹쳐 표시되고 내용도 대부분 일회성 피드백이나 진단 출력이기 때문입니다. 저절로 해결되지 않는 오류는 상단 배너에 표시되며 이 스위치의 영향을 받지 않습니다.
zh_hans: 牌桌底部那条浮动消息（连接状态、未自动发送的原因等）。默认关闭——它叠在牌桌上，而内容多半是一次性反馈或诊断输出。真正不会自行恢复的错误走顶部横幅，不受此开关影响。

source: 用 %@ 吃 %@
en: Chi %2$@ using %1$@
ja: %2$@ をチー（%1$@ を使用）
ko: 치 %2$@ (%1$@ 사용)
zh_hans: 用 %1$@ 吃 %2$@

source: 略過此版本
en: Skip This Version
ja: このバージョンをスキップ
ko: 이 버전 건너뛰기
zh_hans: 跳过此版本

source: 畫面
en: Display
ja: 画面
ko: 화면
zh_hans: 画面

source: 發
en: Green
ko: 발
zh_hans: 发

source: 白
en: White
ko: 백

source: 目前不在對局中，以下牌局欄位沒有實際資料。
en: Not currently in a game; the fields below hold no real data.
ja: 現在対局中ではないため、以下の項目には実際のデータがありません。
ko: 현재 대국 중이 아니므로 아래 항목에는 실제 데이터가 없습니다.
zh_hans: 当前不在对局中，以下牌局栏位没有实际数据。

source: 目前版本 %@
en: Current version %@
ja: 現在のバージョン %@
ko: 현재 버전 %@
zh_hans: 当前版本 %@

source: 目前頁面診斷
en: Current Page Diagnostics
ja: 現在のページの診断
ko: 현재 페이지 진단
zh_hans: 当前页面诊断

source: 目前：%@
en: Current: %@
ja: 現在: %@
ko: 현재: %@
zh_hans: 当前：%@

source: 碰
en: Pon
ja: ポン
ko: 퐁

source: 碰 %@
en: Pon %@
ja: ポン %@
ko: 퐁 %@

source: 移除
en: Remove
ja: 削除
ko: 제거

source: 移除「%@」
en: Remove "%@"
ja: 「%@」を削除
ko: "%@" 제거

source: 移除插件失敗：%@
en: Failed to remove plugin: %@
ja: プラグインの削除に失敗しました：%@
ko: 플러그인 제거 실패: %@
zh_hans: 移除插件失败：%@

source: 移除插件？
en: Remove plugin?
ja: プラグインを削除しますか？
ko: 플러그인을 제거할까요?

source: 立即檢查
en: Check Now
ja: 今すぐ確認
ko: 지금 확인
zh_hans: 立即检查

source: 立直
en: Riichi
ja: リーチ
ko: 리치

source: 等待遊戲數據...
en: Waiting for game data...
ja: ゲームデータを待機中...
ko: 게임 데이터 대기 중...
zh_hans: 等待游戏数据...

source: 紅五筒
en: Red 5 Pin
ja: 赤五筒
ko: 적5통
zh_hans: 红五筒

source: 紅五索
en: Red 5 Sou
ja: 赤五索
ko: 적5삭
zh_hans: 红五索

source: 紅五萬
en: Red 5 Man
ja: 赤五萬
ko: 적5만
zh_hans: 红五万

source: 自動
en: Auto
ko: 자동
zh_hans: 自动

source: 自動打牌
en: Auto-play
ja: 自動プレイ
ko: 자동 플레이
zh_hans: 自动打牌

source: 自動打牌停滯 %lld 秒——伺服器已給機會但沒送出（%@）
en: Auto-play stalled for %lld s — the server gave a turn but nothing was sent (%@)
ja: 自動打牌が %lld 秒停滞——サーバーから操作権が与えられましたが送信されませんでした（%@）
ko: 자동 대국 %lld초 정체 — 서버가 기회를 주었으나 전송되지 않음 (%@)
zh_hans: 自动打牌停滞 %lld 秒——服务器已给出机会但没有发送（%@）

source: 自動打牌基準延遲
en: Auto-play base delay
ja: 自動プレイの基準遅延
ko: 자동 플레이 기준 지연
zh_hans: 自动打牌基准延迟

source: 自動打牌模式
en: Auto-play mode
ja: 自動プレイモード
ko: 자동 플레이 모드
zh_hans: 自动打牌模式

source: 自動捲動
en: Auto-scroll
ja: 自動スクロール
ko: 자동 스크롤
zh_hans: 自动滚动

source: 自動操作
en: Automation
ko: 자동 조작
zh_hans: 自动操作

source: 自動檢查更新
en: Check for updates automatically
ja: 更新を自動的に確認
ko: 업데이트 자동 확인
zh_hans: 自动检查更新

source: 自動滾動到最新
en: Auto-scroll to the latest entry
ja: 最新のログまで自動スクロール
ko: 최신 항목으로 자동 스크롤
zh_hans: 自动滚动到最新

source: 自動送出
en: Auto-send
ja: 自動送信
ko: 자동 전송
zh_hans: 自动发送

source: 自動送出不可用
en: Auto-send unavailable
ja: 自動送信は利用できません
ko: 자동 전송 사용 불가
zh_hans: 自动发送不可用

source: 自動送出：不可用
en: Auto-send: unavailable
ja: 自動送信: 利用不可
ko: 자동 전송: 사용 불가
zh_hans: 自动发送：不可用

source: 落地路徑不在插件目錄底下
en: Install path is outside the plugins directory
ja: インストール先がプラグインフォルダの外です
ko: 설치 경로가 플러그인 폴더 밖에 있음
zh_hans: 落地路径不在插件目录底下

source: 西
en: West
ko: 서

source: 西%lld局
en: West %lld
ko: 서%lld국

source: 西家
en: West
ko: 서가

source: 規則
en: Rules
ja: ルール
ko: 규칙
zh_hans: 规则

source: 視窗在背景時保持遊戲運作
en: Keep the game running while the window is in the background
ja: ウインドウがバックグラウンドでもゲームを動作させる
ko: 창이 백그라운드일 때도 게임 계속 실행
zh_hans: 窗口在后台时保持游戏运行

source: 視窗被蓋住或 App 隱藏時，遊戲仍以低頻率運作，避免停止心跳而斷線；會持續耗用少量 CPU。
en: When the window is covered or the app is hidden, the game keeps running at a low rate so the heartbeat doesn't stop and the connection isn't dropped; this uses a small amount of CPU continuously.
ja: ウインドウが隠れたりアプリが非表示になっても、ハートビートが止まって切断されないよう、ゲームを低頻度で動作させ続けます。少量の CPU を継続的に消費します。
ko: 창이 가려지거나 앱이 숨겨져도 하트비트가 멈춰 연결이 끊기지 않도록 게임을 낮은 빈도로 계속 실행합니다. CPU를 조금씩 계속 사용합니다.
zh_hans: 窗口被遮挡或 App 隐藏时，游戏仍以低频率运行，避免心跳停止而断线；会持续消耗少量 CPU。

source: 設定
en: Settings
ko: 설정
zh_hans: 设置

source: 設定中的啟用數：%lld。下方 registered 是目前頁面實際註冊結果。
en: Enabled in settings: %lld. "registered" below is what the current page actually registered.
ja: 設定での有効数: %lld。下の registered は現在のページに実際に登録された結果です。
ko: 설정에서 사용 중인 수: %lld. 아래 registered는 현재 페이지에 실제로 등록된 결과입니다.
zh_hans: 设置中的启用数：%lld。下方 registered 是当前页面实际注册的结果。

source: 語言
en: Language
ja: 言語
ko: 언어
zh_hans: 语言

source: 讀不到 repo %@/%@
en: Cannot read repo %@/%@
ja: リポジトリ %@/%@ を読み取れません
ko: 저장소 %@/%@을(를) 읽을 수 없음
zh_hans: 读不到 repo %@/%@

source: 讀不到 repo tree
en: Cannot read repo tree
ja: リポジトリの tree を読み取れません
ko: 저장소 tree를 읽을 수 없음
zh_hans: 读不到 repo tree

source: 讀不到金鑰狀態：%@
en: Cannot read key status: %@
ja: キーの状態を取得できません: %@
ko: 키 상태를 읽을 수 없습니다: %@
zh_hans: 无法读取密钥状态：%@

source: 貼 **GitHub repo**（`owner/repo`，一次多個插件）、gist 連結、或任意 HTTPS 的 plugin.json。只抓一次、預覽確認後才落地。
en: Paste a **GitHub repo** (`owner/repo`, multiple plugins at once), a gist link, or any HTTPS plugin.json. It is fetched only once and nothing is saved until you confirm the preview.
ja: **GitHub repo**（`owner/repo`、複数のプラグインを一度に）、gist のリンク、または任意の HTTPS の plugin.json を貼り付けてください。取得は一度だけで、プレビューで確認するまで保存されません。
ko: **GitHub repo**(`owner/repo`, 여러 플러그인을 한 번에), gist 링크 또는 임의의 HTTPS plugin.json을 붙여넣으세요. 한 번만 가져오며 미리보기에서 확인하기 전에는 저장되지 않습니다.
zh_hans: 粘贴 **GitHub repo**（`owner/repo`，一次可含多个插件）、gist 链接，或任意 HTTPS 的 plugin.json。只抓取一次，预览确认后才会保存。

source: 超過尺寸上限：%@
en: Size limit exceeded: %@
ja: サイズ上限を超えています：%@
ko: 크기 상한 초과: %@
zh_hans: 超过尺寸上限：%@

source: 跟隨系統
en: Follow System
ja: システムに従う
ko: 시스템 설정 따르기
zh_hans: 跟随系统

source: 退化中
en: Degraded
ja: 縮退中
ko: 성능 저하
zh_hans: 降级中

source: 送出前的模擬人類延遲基準；1.0s 為預設，向上更慢、向下更快（隨機分布保留）
en: Baseline for the human-like delay before sending; 1.0s is the default, higher is slower, lower is faster (the random distribution is kept)
ja: 送信前の人間らしい遅延の基準値。1.0s が既定で、大きいほど遅く、小さいほど速くなります（ランダム分布は維持）
ko: 전송 전 사람처럼 보이게 하는 지연의 기준값입니다. 기본값은 1.0s이며, 높일수록 느려지고 낮출수록 빨라집니다(무작위 분포는 유지)
zh_hans: 发送前的模拟人类延迟基准；1.0s 为默认，调高更慢、调低更快（保留随机分布）

source: 送出通道未就緒，放棄續局
en: Send channel not ready; rematch abandoned
ja: 送信経路が準備できていないため、次局を中止しました
ko: 전송 채널이 준비되지 않아 다음 대국을 포기함
zh_hans: 发送通道未就绪，放弃续局

source: 這不是暫時性錯誤，重新載入頁面不會修好；請重新安裝／重新建置 App。
en: This is not a transient error and reloading the page won't fix it; please reinstall or rebuild the app.
ja: 一時的なエラーではなく、ページを再読み込みしても直りません。アプリを再インストールまたは再ビルドしてください。
ko: 일시적인 오류가 아니므로 페이지를 새로고침해도 해결되지 않습니다. 앱을 다시 설치하거나 다시 빌드해 주세요.
zh_hans: 这不是暂时性错误，重新加载页面无法修复；请重新安装／重新构建 App。

source: 這是縮放係數，不是固定值：實際送出仍會套用 ActionDelayModel 的隨機分布。
en: This is a scale factor, not a fixed value: actual sends still follow the random distribution of ActionDelayModel.
ja: これは固定値ではなく倍率です。実際の送信には引き続き ActionDelayModel のランダム分布が適用されます。
ko: 이 값은 고정값이 아니라 배율입니다. 실제 전송에는 여전히 ActionDelayModel의 무작위 분포가 적용됩니다.
zh_hans: 这是缩放系数，不是固定值：实际发送仍会套用 ActionDelayModel 的随机分布。

source: 進入遊戲
en: Enter Game
ja: ゲームに入る
ko: 게임 입장
zh_hans: 进入游戏

source: 進入點讀不到：%@
en: Entry point unreadable: %@
ja: エントリポイントを読み取れません：%@
ko: 진입점을 읽을 수 없음: %@
zh_hans: 入口点读不到：%@

source: 進階設定
en: Advanced Settings
ja: 詳細設定
ko: 고급 설정
zh_hans: 高级设置

source: 遊戲結束
en: Game over
ja: 対局終了
ko: 대국 종료
zh_hans: 游戏结束

source: 運行中
en: Running
ja: 稼働中
ko: 실행 중
zh_hans: 运行中

source: 運行中，連接埠 %lld
en: Running, port %lld
ja: 稼働中、ポート %lld
ko: 실행 중, 포트 %lld
zh_hans: 运行中，端口 %lld

source: 過
en: Skip
ja: スキップ
ko: 스킵
zh_hans: 过

source: 選擇雀魂伺服器
en: Choose a Mahjong Soul server
ja: 雀魂のサーバーを選択
ko: 작혼 서버 선택
zh_hans: 选择雀魂服务器

source: 還有 %lld 個
en: %lld more
ja: ほか %lld 件
ko: %lld개 더 있음
zh_hans: 还有 %lld 个

source: 還沒有可用的三麻 match_sid，不排隊。請先自己點一次三麻的場次入口打一場，Naki 會記下來。
en: No usable Sanma match_sid yet; not queuing. Enter a Sanma match yourself once and Naki will remember it.
ja: 利用可能な三麻の match_sid がまだないため、マッチングしません。先に一度ご自身で三麻の対局に入ってください。Naki が記録します。
ko: 사용 가능한 3인 마작 match_sid가 아직 없어 대기열에 넣지 않습니다. 먼저 직접 3인 마작 대국에 한 번 들어가 주세요. Naki가 기록합니다.
zh_hans: 还没有可用的三麻 match_sid，不排队。请先自己点一次三麻的场次入口打一场，Naki 会记下来。

source: 還沒有可用的四麻 match_sid，不排隊。請先自己點一次四麻的場次入口打一場，Naki 會記下來。
en: No usable Yonma match_sid yet; not queuing. Enter a Yonma match yourself once and Naki will remember it.
ja: 利用可能な四麻の match_sid がまだないため、マッチングしません。先に一度ご自身で四麻の対局に入ってください。Naki が記録します。
ko: 사용 가능한 4인 마작 match_sid가 아직 없어 대기열에 넣지 않습니다. 먼저 직접 4인 마작 대국에 한 번 들어가 주세요. Naki가 기록합니다.
zh_hans: 还没有可用的四麻 match_sid，不排队。请先自己点一次四麻的场次入口打一场，Naki 会记下来。

source: 還沒有插件 log。啟用一個插件、進一局後，它經 ctx.log 送出的訊息會即時出現在這裡。
en: No plugin logs yet. Enable a plugin and start a game; messages it sends through ctx.log will appear here in real time.
ja: プラグインのログはまだありません。プラグインを有効にして対局に入ると、ctx.log で送信されたメッセージがここにリアルタイムで表示されます。
ko: 아직 플러그인 로그가 없습니다. 플러그인을 사용하고 대국에 들어가면 ctx.log로 보낸 메시지가 여기에 실시간으로 표시됩니다.
zh_hans: 还没有插件日志。启用一个插件并进入一局后，它通过 ctx.log 发出的消息会实时显示在这里。

source: 還沒有插件。可以在上方貼 GitHub repo、gist 或 plugin.json 網址引入。
en: No plugins yet. You can paste a GitHub repo, gist or plugin.json URL above to import one.
ja: プラグインはまだありません。上に GitHub repo、gist、plugin.json の URL を貼り付けて取り込めます。
ko: 아직 플러그인이 없습니다. 위에 GitHub repo, gist 또는 plugin.json URL을 붙여넣어 가져올 수 있습니다.
zh_hans: 还没有插件。可以在上方粘贴 GitHub repo、gist 或 plugin.json 网址引入。

source: 還沒有插件。點下方「從來源加入」貼 GitHub repo / gist / URL 引入。
en: No plugins yet. Click "Add from Source" below and paste a GitHub repo / gist / URL.
ja: プラグインはまだありません。下の「ソースから追加」をクリックして GitHub repo / gist / URL を貼り付けてください。
ko: 아직 플러그인이 없습니다. 아래의 "소스에서 추가"를 눌러 GitHub repo / gist / URL을 붙여넣으세요.
zh_hans: 还没有插件。点击下方“从来源添加”，粘贴 GitHub repo / gist / URL 引入。

source: 重建 Bot
en: Rebuild Bot
ja: Bot を再構築
ko: Bot 재생성

source: 重新注入已啟用插件並檢查
en: Re-inject Enabled Plugins and Check
ja: 有効なプラグインを再注入して確認
ko: 사용 중인 플러그인을 다시 주입하고 확인
zh_hans: 重新注入已启用插件并检查

source: 重新載入
en: Reload
ja: 再読み込み
ko: 새로고침
zh_hans: 重新加载

source: 金鑰狀態
en: Key status
ja: キーの状態
ko: 키 상태
zh_hans: 密钥状态

source: 錯誤：JavaScript 注入失敗，Naki 無法讀牌局也無法送出動作（%@）
en: Error: JavaScript injection failed; Naki can neither read the game nor send actions (%@)
ja: エラー：JavaScript の注入に失敗しました。Naki は対局を読めず操作も送れません（%@）
ko: 오류: JavaScript 주입 실패. Naki가 대국을 읽을 수도, 동작을 보낼 수도 없습니다 (%@)
zh_hans: 错误：JavaScript 注入失败，Naki 无法读取牌局也无法发送动作（%@）

source: 開
en: On
ja: オン
ko: 켜짐
zh_hans: 开

source: 開啟
en: Turn On
ja: オンにする
ko: 켜기
zh_hans: 开启

source: 開啟後，有 injectSend/rewriteSend 能力的插件可以用你的帳號送出 Liqi request。預設關閉。只在測試帳號、且你信任插件時開。
en: When on, plugins with the injectSend/rewriteSend capability can send Liqi requests with your account. Off by default. Turn it on only for a test account and plugins you trust.
ja: オンにすると、injectSend/rewriteSend 機能を持つプラグインがあなたのアカウントで Liqi request を送信できます。既定ではオフです。テスト用アカウントで、信頼できるプラグインの場合のみオンにしてください。
ko: 켜면 injectSend/rewriteSend 기능이 있는 플러그인이 내 계정으로 Liqi request를 보낼 수 있습니다. 기본값은 꺼짐입니다. 테스트 계정이고 플러그인을 신뢰할 때만 켜세요.
zh_hans: 开启后，具有 injectSend/rewriteSend 能力的插件可以用你的账号发送 Liqi request。默认关闭。仅在测试账号且你信任插件时开启。

source: 開始
en: Start
ko: 시작
zh_hans: 开始

source: 關
en: Off
ja: オフ
ko: 끔
zh_hans: 关

source: 關閉
en: Off
ja: オフ
ko: 끄기
zh_hans: 关闭

source: 關閉提示
en: Dismiss
ja: 閉じる
ko: 닫기
zh_hans: 关闭提示

source: 限額
en: Limits
ja: 上限
ko: 한도
zh_hans: 限额

source: 隱藏決策面板
en: Hide decision panel
ja: 判断パネルを非表示
ko: 판단 패널 숨기기
zh_hans: 隐藏决策面板

source: 雀魂伺服器
en: Mahjong Soul Server
ja: 雀魂サーバー
ko: 작혼 서버
zh_hans: 雀魂服务器

source: 雀魂已加載，等待連接...
en: Mahjong Soul loaded, waiting for connection...
ja: 雀魂を読み込みました。接続を待っています...
ko: 작혼 로드됨, 연결 대기 중...
zh_hans: 雀魂已加载，等待连接...

source: 雀魂遊戲畫面
en: Mahjong Soul game screen
ja: 雀魂のゲーム画面
ko: 작혼 게임 화면
zh_hans: 雀魂游戏画面

source: 雲端失敗——正在用本地模型（連續 %lld 手）
en: Cloud failed — using the local model (%lld in a row)
ja: クラウド失敗——ローカルモデルを使用中（%lld 手連続）
ko: 클라우드 실패 — 로컬 모델 사용 중 (%lld수 연속)
zh_hans: 云端失败——正在使用本地模型（连续 %lld 手）

source: 雲端推論
en: Cloud inference
ja: クラウド推論
ko: 클라우드 추론
zh_hans: 云端推理

source: 雲端推論 (3P)
en: Cloud inference (3P)
ja: クラウド推論 (3P)
ko: 클라우드 추론 (3P)
zh_hans: 云端推理 (3P)

source: 雲端推論 (3P) ⚠️ 未生效，無推論
en: Cloud inference (3P) ⚠️ inactive, no inference
ja: クラウド推論 (3P) ⚠️ 未適用、推論なし
ko: 클라우드 추론 (3P) ⚠️ 미적용, 추론 없음
zh_hans: 云端推理 (3P) ⚠️ 未生效，无推理

source: 雲端推論尚未生效，仍在用內建本地模型。還缺：%@
en: Cloud inference is not active yet; still using the built-in local model. Missing: %@
ja: クラウド推論はまだ有効ではなく、内蔵のローカルモデルを使用中です。不足: %@
ko: 클라우드 추론이 아직 적용되지 않아 내장 로컬 모델을 사용 중입니다. 부족한 항목: %@
zh_hans: 云端推理尚未生效，仍在使用内置本地模型。还缺：%@

source: 雲端推論尚未生效，還缺：%@
en: Cloud inference is not active yet. Missing: %@
ja: クラウド推論はまだ有効ではありません。不足: %@
ko: 클라우드 추론이 아직 적용되지 않았습니다. 부족한 항목: %@
zh_hans: 云端推理尚未生效，还缺：%@

source: 雲端推論已生效——對局中會以雲端決策為準
en: Cloud inference is active — the cloud decision will be used in games
ja: クラウド推論は有効です——対局中はクラウドの判断が優先されます
ko: 클라우드 추론이 적용 중입니다——대국 중에는 클라우드 판단이 우선합니다
zh_hans: 云端推理已生效——对局中以云端决策为准

source: 雲端推論已生效——點一下切回本地模型
en: Cloud inference is active — click to switch back to the local model
ja: クラウド推論は有効です——クリックでローカルモデルに戻します
ko: 클라우드 추론이 적용 중입니다——클릭하면 로컬 모델로 돌아갑니다
zh_hans: 云端推理已生效——点一下切回本地模型

source: 雲端推論已關閉，目前使用內建本地模型
en: Cloud inference is off; using the built-in local model
ja: クラウド推論はオフです。内蔵のローカルモデルを使用中
ko: 클라우드 추론이 꺼져 있으며 내장 로컬 모델을 사용 중입니다
zh_hans: 云端推理已关闭，当前使用内置本地模型

source: 雲端狀態
en: Cloud status
ja: クラウドの状態
ko: 클라우드 상태
zh_hans: 云端状态

source: 非法路徑（拒絕刪除 %@）
en: Illegal path (refusing to delete %@)
ja: 不正なパスです（%@ の削除を拒否）
ko: 잘못된 경로(%@ 삭제 거부)
zh_hans: 非法路径（拒绝删除 %@）

source: 頁面沒有回傳診斷資料
en: The page returned no diagnostic data
ja: ページから診断データが返されませんでした
ko: 페이지에서 진단 데이터를 반환하지 않았습니다
zh_hans: 页面没有返回诊断数据

source: 頁面載入失敗：Naki 讀不到牌局
en: Page failed to load: Naki cannot read the game
ja: ページの読み込みに失敗: Naki は対局を読み取れません
ko: 페이지 로드 실패: Naki가 대국을 읽을 수 없습니다
zh_hans: 页面加载失败：Naki 读不到牌局

source: 預覽 %lld 個——勾選要引入的：
en: Preview of %lld — select the ones to import:
ja: %lld 個をプレビュー——取り込むものを選択してください:
ko: %lld개 미리보기——가져올 항목을 선택하세요:
zh_hans: 预览 %lld 个——勾选要引入的：

source: 預設
en: Default
ja: 既定
ko: 기본값
zh_hans: 默认

source: 預設：%@（Akagi 官方；也可填自架位址）
en: Default: %@ (official Akagi; you can also enter a self-hosted address)
ja: 既定: %@（Akagi 公式。自前のアドレスも指定できます）
ko: 기본값: %@(Akagi 공식, 자체 호스팅 주소도 입력 가능)
zh_hans: 默认：%@（Akagi 官方；也可填写自建地址）

source: 顯示/隱藏日誌
en: Show/Hide log
ja: ログの表示/非表示
ko: 로그 표시/숨기기
zh_hans: 显示/隐藏日志

source: 顯示/隱藏遊戲面板
en: Show/Hide game panel
ja: ゲームパネルの表示/非表示
ko: 게임 패널 표시/숨기기
zh_hans: 显示/隐藏游戏面板

source: 顯示或隱藏日誌
en: Show or hide log
ja: ログを表示または非表示
ko: 로그 표시 또는 숨기기
zh_hans: 显示或隐藏日志

source: 顯示或隱藏遊戲面板
en: Show or hide game panel
ja: ゲームパネルを表示または非表示
ko: 게임 패널 표시 또는 숨기기
zh_hans: 显示或隐藏游戏面板

source: 顯示日誌
en: Show log
ja: ログを表示
ko: 로그 표시
zh_hans: 显示日志

source: 顯示決策面板
en: Show decision panel
ja: 判断パネルを表示
ko: 판단 패널 표시
zh_hans: 显示决策面板

source: 顯示狀態訊息列
en: Show status message bar
ja: ステータスメッセージバーを表示
ko: 상태 메시지 표시줄 표시
zh_hans: 显示状态消息栏

source: （但開關未開，對局仍走本地模型）
en: (but the switch is off, so games still use the local model)
ja: （ただしスイッチがオフのため、対局はローカルモデルのままです）
ko: (하지만 스위치가 꺼져 있어 대국은 계속 로컬 모델을 사용합니다)
zh_hans: （但开关未开，对局仍使用本地模型）

source: API Key
ja: API キー

source: 雀魂麻將
zh_hans: 雀魂麻将
